CSI API ETABS v1

# cDesignCompositeBeamSetAutoSelectNull Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetAutoSelectNull(
    	string Name,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetAutoSelectNull (
    	Name As String,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cDesignCompositeBeam
    Dim Name As String
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetAutoSelectNull(Name,
    	ItemType)

    int SetAutoSelectNull(
    	String^ Name,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetAutoSelectNull :
            Name : string *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cDesignCompositeBeam Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com